import "../App.css";

function AboutStudio() {
  return (
    <div className="about_studio">
      <div className="container">
        <div className="article_about">
          <h1 className="about_heading">О нашей студии</h1>
          <div className="studio_columns">
            <div className="article">
              <h3 className="article_heading">Команда Black Lotus</h3>
              <p className="article_para">
                Под брендом студии «Black Lotus» объединили творческие
                стремления мастера с богатым опытом работы и знакомые не первый
                год, поэтому в студии всегда царит уютная домашняя обстановка.
                Мы не завышаем стоимость работ, растягивая количество сеансов.
                Каждый мастер нашей студии – это профессионал, который уже
                заработал солидную репутацию среди клиентов и коллег. Мы
                уверены, что любая модификация тела – это одновременно веселая и
                оригинальная синергия моды, искусства и ремесла, так и
                ответственный шаг, и процедура повышенной опасности, поэтому в
                нашей студии каждый член команды осознает свою ответственность,
                и всегда помнит о том, что должен поддерживать свой высокий
                профессиональный уровень.
              </p>
              <p className="article_para">
                Если Вы решили изменить себя или только думаете об этом,
                приглашаем в комфортной обстановке представить, обсудить и
                реализовать свои идеи вместе с нами. Мы открыты ежедневно и
                очень рады гостям нашей студии.
              </p>
            </div>
            <div className="article">
              <h3 className="article_heading">Студии и Магазин Украшений</h3>
              <p className="article_para">
                Уютная студия в центре Петербурга с отдельными кабинетами, где
                топ-мастера помогут воплотить любые фантазии о вашем визуальном
                образе. Располагается на улице 2-я Советская.
              </p>
              <p className="article_para">
                Здесь вы сможете найти все необходимое для своего творчества и
                самовыражения. Наша команда мастеров с радостью приветствует вас
                в этом новом пространстве.
              </p>
              <p className="article_para">
                Наша студия открыта не только для людей желающих изменить свою
                внешность, но и для тех, кто сам хочет стать мастером тату или
                пирсинга. Мы проводим индивидуальные занятия по свободному
                графику и предоставляем стажировку на живых моделях. Лучшие
                ученики имеют возможность попасть в команду HurtLand. Если у Вас
                есть другие вопросы, творческие или коммерческие предложения мы
                рады рассмотреть их.
              </p>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
}

export default AboutStudio;
